console.log(`Вёрстка соответствует макету. Ширина экрана 768px +26
      блок <header> +2
      секция Welcome +2
      секция About +4
      секция Favorites +2
      Сделать кнопку own для последней книги +2
      секция CoffeShop +4
      секция Contacts +4
      секция LibraryCard +4
      блок <footer> + 2

      Ни на одном из разрешений до 640px включительно не появляется горизонтальная полоса прокрутки. Весь контент страницы при этом сохраняется: не обрезается и не удаляется +12

      нет полосы прокрутки при ширине страницы от 1440рх до 640рх +4

      элементы не выходят за пределы окна браузера при ширине страницы от 1440рх до 640рх +4

      элементы не наезжают друг на друга при ширине страницы от 1440рх до 640рх +4

      На ширине экрана 768рх реализовано адаптивное меню +12 

      Версия Tablet, отступ иконки юзера от правого края - 105px. 
      
      Если иконка юзера не прыгает (не меняет позиции при открытии меню), независимо от величины отступа: +2

      при нажатии на бургер-иконку плавно появляется адаптивное меню +4

      при нажатии на крестик, или на область вне меню, адаптивное меню плавно скрывается, уезжая за экран +2

      ссылки в адаптивном меню работают, обеспечивая плавную прокрутку по якорям при нажатии, а само адаптивное меню при этом плавно скрывается +2

      размеры открытого бургер-меню соответствуют макету, так же открытое бургер-меню проверяется на PixelPerfect +2

      Итого: 50 баллов`);